llm/minimax_m2/b200/bench/bench_random_mid.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='MiniMaxAI/MiniMax-M2', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/minimax_m2/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/minimax_m2/b200/profile/random_mid', profile_prefix='random_mid', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='MiniMaxAI/MiniMax-M2', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/minimax_m2/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/minimax_m2/b200/profile/random_mid', profile_prefix='random_mid', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 149865
#Output tokens: 154274
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://127.0.0.1:30000/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/data/bbuf/kda-pilot/llm/minimax_m2/b200/profile/random_mid/1781923519.4808', 'profile_prefix': 'random_mid'}
Profiler started

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     300       
Benchmark duration (s):                  101.93    
Total input tokens:                      149865    
Total input text tokens:                 149865    
Total generated tokens:                  154274    
Total generated tokens (retokenized):    153692    
Request throughput (req/s):              2.94      
Input token throughput (tok/s):          1470.25   
Output token throughput (tok/s):         1513.50   
Peak output token throughput (tok/s):    1760.00   
Peak concurrent requests:                39        
Total token throughput (tok/s):          2983.75   
Concurrency:                             30.35     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   10313.49  
Median E2E Latency (ms):                 10235.22  
P90 E2E Latency (ms):                    18407.71  
P95 E2E Latency (ms):                    19289.51  
P99 E2E Latency (ms):                    20024.59  
---------------Time to First Token----------------
Mean TTFT (ms):                          113.74    
Median TTFT (ms):                        67.95     
P90 TTFT (ms):                           442.87    
P95 TTFT (ms):                           496.62    
P99 TTFT (ms):                           497.75    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.04     
Median TPOT (ms):                        20.15     
P90 TPOT (ms):                           20.94     
P95 TPOT (ms):                           21.47     
P99 TPOT (ms):                           23.04     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           19.87     
Median ITL (ms):                         18.20     
P90 ITL (ms):                            19.12     
P95 ITL (ms):                            30.14     
P99 ITL (ms):                            44.21     
Max ITL (ms):                            623.26    
==================================================